[
    {
        "title": "Sistema de Sumarização",
        "period": "03/2023 - 06/2023",
        "course": "FATEC SJC - 6º Semestre",
        "description": "O objetivo deste projeto é desenvolver um sistema inovador que utiliza inteligência artificial (IA) em linguagem natural para sumarizar automaticamente grandes volumes de comentários de clientes. O sistema irá gerar resumos concisos e informativos, categorizados por diversos critérios relevantes para análise, como produto, categoria, recomendação, geografia e demografia.",
        "image": "assets/images/api-sumarizacao.png",
        "links": [
            {
                "url": "https://github.com/EquipeGfour/API-6-Semestre-Dom-Rock",
                "icon": "fab fa-github"
            }
        ]
    },
    {
        "title": "TaskManager: aplicativo organizacional",
        "period": "08/2023 - 11/2023",
        "course": "FATEC SJC - 5º Semestre",
        "description": "O desafio proposto pela Oracle Academy era de desenvolver uma aplicação mobile que visa a organização, priorização de tarefas e atribuições diárias, tanto na rotina pessoal quanto no mundo corporativo, priorizando-as por urgência e com marcações de tempo para um controle mais preciso tanto dos objetivos quanto das tarefas, além da mensuração da quantidade de tarefas realizadas e apresentação mensal de resultados de determinado usuário em um dashboard.",
        "image": "assets/images/api-taskmanager.png",
        "links": [
            {
                "url": "https://github.com/EquipeGfour/API-5Semestre-OracleAcademy",
                "icon": "fab fa-github"
            }
        ]
    },
    {
        "title": "EstacSUS: Estação Metereológica",
        "period": "03/2023 - 06/2023",
        "course": "FATEC SJC - 4º Semestre",
        "description": "O desafio proposto pela TecSus era de desenvolver uma estação meteorológica. O principal objetivo de criar uma estação meteorológica é coletar dados meteorológicos em tempo real. Esses dados serão coletados por meio de sensores instalados na estação e serão enviados para um servidor na nuvem por meio de uma conexão com a internet. Os dados serão coletados em um tempo determinado e serão disponibilizados para os usuários da estação meteorológica.",
        "image": "assets/images/api-estacsus.png",
        "links": [
            {
                "url": "https://github.com/EquipeGfour/API-4SemestreDSM-EstacaoMeteorologica",
                "icon": "fab fa-github"
            }
        ]
    },
    {
        "title": "UOLshop: Site de venda cruzada (Cross-Selling)",
        "period": "08/2022 - 11/2022",
        "course": "FATEC SJC - 3º Semestre",
        "description": "O desafio proposto pela UOL era de desenvolver uma plataforma para incentivar o cross-selling dos produtos e serviços dentro da página de compra, auxiliando no aumento de receita da área de negócio. Com isso, foi firmada a parceria entre a Fatec e a UOL para buscar alternativas disruptivas de cross-selling de produtos e serviços da UOL.",
        "image": "assets/images/api-uolshop.png",
        "links": [
            {
                "url": "https://github.com/Group-NoName/noname-documentacoes",
                "icon": "fab fa-github"
            }
        ]
    },
    {
        "title": "IONICRH: Gerenciamento de recursos humanos.",
        "period": "03/2022 - 06/2022",
        "course": "FATEC SJC - 2º Semestre",
        "description": "O desafio proposto pela Ionic era de desenvolver uma plataforma para apoiar a área de Recursos Humanos e Departamento Pessoal para controle de todos os talentos da empresa (pessoas). Após a aprovação no processo seletivo se faz necessário o cadastro do colaborador (CLT ou PJ) em um sistema que traga informações sobre sua contratação, controle de documentação, dados, entre outros dados. Temos que levar em consideração da LGPD para que o acesso seja restrito.",
        "image": "assets/gifs/api-ionicrh.gif",
        "links": [
            {
                "url": "https://github.com/excalibur-coders/IONICRH",
                "icon": "fab fa-github"
            }
        ]
    },
    {
        "title": "FATEC SJC: Portal de Informações.",
        "period": "09/2021 - 12/2021",
        "course": "FATEC SJC - 1º Semestre",
        "description": "Desenvolvimento de um portal de comunicação alternativo para a FATEC durante a pandemia de COVID-19, visando aliviar a sobrecarga do portal oficial e garantir o acesso contínuo a informações e serviços essenciais para alunos, professores e funcionários.",
        "image": "assets/gifs/api-fatec.gif",
        "links": [
            {
                "url": "https://github.com/T3chnogroup/Projeto-InFatec",
                "icon": "fab fa-github"
            }
        ]
    }
]